/***********************************************
 > 𝐀𝐮𝐭𝐡𝐨𝐫:  𝑨𝒅𝒎𝒊𝒏: 𝒀𝒐𝒖𝒏𝒋 𝑶𝑺 🎨
***********************************************/
// 📌 𝐍𝐨𝐭𝐞: 𝐓𝐡𝐢𝐬 𝐌𝐨𝐝𝐮𝐥𝐞,𝐬𝐜𝐫𝐢𝐩𝐭.𝐣𝐬 𝐟𝐢𝐥𝐞 𝐢𝐬 𝐜𝐫𝐞𝐚𝐭𝐞𝐝 𝐛𝐲 𝐊𝐇𝐎𝐍𝐆 𝐌𝐀𝐍𝐇 𝐘𝐄𝐍. 
// 𝐏𝐥𝐞𝐚𝐬𝐞 𝐝𝐨 𝐧𝐨𝐭 𝐞𝐝𝐢𝐭 𝐰𝐢𝐭𝐡𝐨𝐮𝐭 𝐩𝐞𝐫𝐦𝐢𝐬𝐬𝐢𝐨𝐧. 𝐓𝐡𝐚𝐧𝐤 𝐲𝐨𝐮 🩵
// 𝐋𝐮̛𝐮 𝐲́ 𝐤𝐡𝐢 𝐬𝐮̛̉ 𝐝𝐮̣𝐧𝐠: ⚠️𝐃𝐨𝐚̣𝐧 𝐦𝐚̃ 𝐧𝐚̀𝐲 𝐜𝐡𝐢̉ 𝐝𝐚̀𝐧𝐡 𝐜𝐡𝐨 𝐦𝐮̣𝐜 𝐝𝐢́𝐜𝐡 𝐦𝐨̛̉ 𝐤𝐡𝐨𝐚́ 𝐯𝐢𝐩 𝐜𝐡𝐨 𝐮̛́𝐧𝐠 𝐝𝐮̣𝐧𝐠. 𝐕𝐮𝐢 𝐥𝐨̀𝐧𝐠 𝐤𝐡𝐨̂𝐧𝐠 𝐬𝐚𝐨 𝐜𝐡𝐞́𝐩 𝐡𝐨𝐚̣̆𝐜 𝐛𝐚́𝐧 𝐥𝐚̣𝐢! ❗️
// 🫆 𝐋𝐢𝐧𝐤 𝐛𝐢𝐨 𝐭𝐚̉𝐢 𝐱𝐮𝐨̂́𝐧𝐠: 𝐡𝐭𝐭𝐩𝐬://𝐲𝐨𝐮𝐧𝐣.𝐢𝐨.𝐯𝐧/
/******************************
𝑨𝒅𝒎𝒊𝒏: 𝒀𝒐𝒖𝒏𝒋 𝑶𝑺 🎭
𝑭𝒂𝒄𝒆𝒃𝒐𝒐𝒌:𝑲𝒉𝒐𝒏𝒈 𝑴𝒂𝒏𝒉 𝒀𝒆𝒏 👑 
𝑪𝒐𝒏𝒕𝒂𝒄𝒕:
𝒛𝒍:𝟎𝟗𝟖𝟏.𝟑𝟎𝟗.𝟗𝟐𝟏
𝑻𝒆𝒍𝒆𝒈𝒂𝒎: 𝒚𝒐𝒖𝒏𝒋_𝒊𝒄𝒍𝒐𝒖𝒅
*******************************/
var _0x3aafd9=_0x9294;(function(_0x4bd06b,_0x342673){var _0x219772=_0x9294,_0x52473f=_0x4bd06b();while(!![]){try{var _0x5daa27=-parseInt(_0x219772(0x7f))/0x1*(parseInt(_0x219772(0x7e))/0x2)+-parseInt(_0x219772(0x89))/0x3+-parseInt(_0x219772(0x85))/0x4+-parseInt(_0x219772(0x83))/0x5+-parseInt(_0x219772(0x7c))/0x6*(parseInt(_0x219772(0x84))/0x7)+-parseInt(_0x219772(0x87))/0x8*(-parseInt(_0x219772(0x80))/0x9)+-parseInt(_0x219772(0x8a))/0xa*(-parseInt(_0x219772(0x81))/0xb);if(_0x5daa27===_0x342673)break;else _0x52473f['push'](_0x52473f['shift']());}catch(_0x2c3097){_0x52473f['push'](_0x52473f['shift']());}}}(_0x21e6,0x9ead4));const version=_0x3aafd9(0x7d);function setHeaderValue(_0x4ba21b,_0x465d0c,_0x28933a){var _0x38848e=_0x3aafd9,_0x49e24f=_0x465d0c[_0x38848e(0x88)]();_0x49e24f in _0x4ba21b?_0x4ba21b[_0x49e24f]=_0x28933a:_0x4ba21b[_0x465d0c]=_0x28933a;}function _0x9294(_0x482598,_0xeb5e66){_0x482598=_0x482598-0x7b;var _0x21e6c7=_0x21e6();var _0x929407=_0x21e6c7[_0x482598];return _0x929407;}var modifiedHeaders=$request[_0x3aafd9(0x82)];function _0x21e6(){var _0x594c23=['V1.0.3','236JghxpQ','4003OJbZnS','9DFsCHQ','140140NwGUBa','headers','5635830EFFbIP','14UrLYkj','2882356ePlNED','X-RevenueCat-ETag','6312760dNALQt','toLowerCase','3828900wCfpVf','3310MqCIGL','stringify','2279058SPFYrl'];_0x21e6=function(){return _0x594c23;};return _0x21e6();}setHeaderValue(modifiedHeaders,_0x3aafd9(0x86),''),console['log']('Modified\x20Headers:',JSON[_0x3aafd9(0x7b)](modifiedHeaders)),$done({'headers':modifiedHeaders});
// ========= Younj iu  ========= //

// deleteHeader.js - Khổng Mạnh Yên
// Updated deleteHeader.js
// ========= Header Modification ========= //